---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.YOffset
source: html/fa7484b3-067a-ee6a-bcda-87250dee2acb.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.YOffset Property

Y offset.

## Syntax (C#)
```csharp
public double YOffset { get; }
```